<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"azurerm","backend":"df5855fa666a7332160ece3d65bd1caa8427fd7edb33f6550f9f9ca079d3839d","plan_job_ref":"Job CI-CD pipeline #110 at https://github.com/HasanAshab/spring-react-devops-appservice-infra/actions/runs/16520686950","plan_out_hash":"5c7540e8c47677b0101997119e2fa4d989dee2feec1ef272f1b672099b27e3f5","plan_hash":"c0e0876299aebd513cd6da469d508d87620d0f5db79bfb5f99040e26a3e1c664","plan_text_format":"diff-trunc","version":"2.1.0"} -->
Terraform plan in __.__ in the __prod__ workspace
With var files: `prod.tfvars`
<details>
<summary>Plan: 60 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_resource_group.this["centralus"] will be created
+   resource "azurerm_resource_group" "this" {
+       id       = (known after apply)
+       location = "centralus"
+       name     = "rg-three-tier-app-prod-centralus"
    }

  # azurerm_resource_group.this["eastus"] will be created
+   resource "azurerm_resource_group" "this" {
+       id       = (known after apply)
+       location = "eastus"
+       name     = "rg-three-tier-app-prod-eastus"
    }

  # azurerm_virtual_network.this["centralus"] will be created
+   resource "azurerm_virtual_network" "this" {
+       address_space                  = [
+           "10.254.0.0/16",
        ]
+       dns_servers                    = (known after apply)
+       guid                           = (known after apply)
+       id                             = (known after apply)
+       location                       = "centralus"
+       name                           = "vnet-three-tier-app-prod-centralus"
+       private_endpoint_vnet_policies = "Disabled"
+       resource_group_name            = "rg-three-tier-app-prod-centralus"
+       subnet                         = (known after apply)
    }

  # azurerm_virtual_network.this["eastus"] will be created
+   resource "azurerm_virtual_network" "this" {
+       address_space                  = [
+           "10.254.0.0/16",
        ]
+       dns_servers                    = (known after apply)
+       guid                           = (known after apply)
+       id                             = (known after apply)
+       location                       = "eastus"
+       name                           = "vnet-three-tier-app-prod-eastus"
+       private_endpoint_vnet_policies = "Disabled"
+       resource_group_name            = "rg-three-tier-app-prod-eastus"
+       subnet                         = (known after apply)
    }

  # module.asp["centralus"].azurerm_monitor_autoscale_setting.asp[0] will be created
+   resource "azurerm_monitor_autoscale_setting" "asp" {
+       enabled             = true
+       id                  = (known after apply)
+       location            = "centralus"
+       name                = "mas-three-tier-app-prod-centralus"
+       resource_group_name = "rg-three-tier-app-prod-centralus"
+       target_resource_id  = (known after apply)

+       profile {
+           name = "default"

+           capacity {
+               default = 2
+               maximum = 5
+               minimum = 2
            }

+           rule {
+               metric_trigger {
+                   metric_name        = "CpuPercentage"
+                   metric_resource_id = (known after apply)
+                   operator           = "GreaterThan"
+                   statistic          = "Average"
+                   threshold          = 80
+                   time_aggregation   = "Average"
+                   time_grain         = "PT1M"
+                   time_window        = "PT5M"
                }
+               scale_action {
+                   cooldown  = "PT5M"
+                   direction = "Increase"
+                   type      = "ChangeCount"
+                   value     = 1
                }
            }
+           rule {
+               metric_trigger {
+                   metric_name        = "CpuPercentage"
+                   metric_resource_id = (known after apply)
+                   operator           = "LessThan"
+                   statistic          = "Average"
+                   threshold          = 25
+                   time_aggregation   = "Average"
+                   time_grain         = "PT1M"
+                   time_window        = "PT5M"
                }
+               scale_action {
+                   cooldown  = "PT5M"
+                   direction = "Decrease"
+                   type      = "ChangeCount"
+                   value     = 1
                }
            }
        }
    }

  # module.asp["eastus"].azurerm_monitor_autoscale_setting.asp[0] will be created
+   resource "azurerm_monitor_autoscale_setting" "asp" {
+       enabled             = true
+       id                  = (known after apply)
+       location            = "eastus"
+       name                = "mas-three-tier-app-prod-eastus"
+       resource_group_name = "rg-three-tier-app-prod-eastus"
+       target_resource_id  = (known after apply)

+       profile {
+           name = "default"

+           capacity {
+               default = 2
+               maximum = 5
+               minimum = 2
            }

+           rule {
+               metric_trigger {
+                   metric_name        = "CpuPercentage"
+                   metric_resource_id = (known after apply)
+                   operator           = "GreaterThan"
+                   statistic          = "Average"
+                   threshold          = 80
+                   time_aggregation   = "Average"
+                   time_grain         = "PT1M"
+                   time_window        = "PT5M"
                }
+               scale_action {
+                   cooldown  = "PT5M"
+                   direction = "Increase"
+                   type      = "ChangeCount"
+                   value     = 1
                }
            }
+           rule {
+               metric_trigger {
+                   metric_name        = "CpuPercentage"
+                   metric_resource_id = (known after apply)
+                   operator           = "LessThan"
+                   statistic          = "Average"
+                   threshold          = 25
+                   time_aggregation   = "Average"
+                   time_grain         = "PT1M"
+                   time_window        = "PT5M"
                }
+               scale_action {
+                   cooldown  = "PT5M"
+                   direction = "Decrease"
+                   type      = "ChangeCount"
+                   value     = 1
                }
            }
        }
    }

  # module.backend["centralus"].azurerm_subnet.this will be created
+   resource "azurerm_subnet" "this" {
+       address_prefixes                              = [
+           "10.254.0.64/26",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = (known after apply)
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-three-tier-app-prod-centralus"
+       virtual_network_name                          = "vnet-three-tier-app-prod-centralus"

+       delegation {
+           name = "webapp"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/action",
                ]
+               name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.backend["eastus"].azurerm_subnet.this will be created
+   resource "azurerm_subnet" "this" {
+       address_prefixes                              = [
+           "10.254.0.64/26",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = (known after apply)
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-three-tier-app-prod-eastus"
+       virtual_network_name                          = "vnet-three-tier-app-prod-eastus"

+       delegation {
+           name = "webapp"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/action",
                ]
+               name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.database.azurerm_mysql_flexible_database.this will be created
+   resource "azurerm_mysql_flexible_database" "this" {
+       charset             = "utf8mb4"
+       collation           = "utf8mb4_unicode_ci"
+       id                  = (known after apply)
+       name                = "db"
+       resource_group_name = "rg-three-tier-app-prod-centralus"
+       server_name         = "mysql-db-three-tier-app-prod-centralus"
    }

  # module.database.azurerm_mysql_flexible_server.this will be created
+   resource "azurerm_mysql_flexible_server" "this" {
+       administrator_login               = "admin4321"
+       administrator_password_wo         = (write-only attribute)
+       administrator_password_wo_version = 1
+       backup_retention_days             = 7
+       fqdn                              = (known after apply)
+       geo_redundant_backup_enabled      = true
+       id                                = (known after apply)
+       location                          = "centralus"
+       name                              = "mysql-db-three-tier-app-prod-centralus"
+       public_network_access             = "Disabled"
+       public_network_access_enabled     = (known after apply)
+       replica_capacity                  = (known after apply)
+       replication_role                  = (known after apply)
+       resource_group_name               = "rg-three-tier-app-prod-centralus"
+       sku_name                          = "B_Standard_B1ms"
+       version                           = "8.0.21"
+       zone                              = (known after apply)

+       high_availability {
+           mode                      = "ZoneRedundant"
+           standby_availability_zone = (known after apply)
        }

+       storage {
+           auto_grow_enabled   = true
+           io_scaling_enabled  = true
+           iops                = (known after apply)
+           log_on_disk_enabled = false
+           size_gb             = (known after apply)
        }
    }

  # module.database.azurerm_private_dns_zone.this will be created
+   resource "azurerm_private_dns_zone" "this" {
+       id                                                    = (known after apply)
+       max_number_of_record_sets                             = (known after apply)
+       max_number_of_virtual_network_links                   = (known after apply)
+       max_number_of_virtual_network_links_with_registration = (known after apply)
+       name                                                  = "privatelink.mysql.database.azure.com"
+       number_of_record_sets                                 = (known after apply)
+       resource_group_name                                   = "rg-three-tier-app-prod-centralus"

+       soa_record (known after apply)
    }

  # module.database.azurerm_private_dns_zone_virtual_network_link.this will be created
+   resource "azurerm_private_dns_zone_virtual_network_link" "this" {
+       id                    = (known after apply)
+       name                  = "dns-link"
+       private_dns_zone_name = "privatelink.mysql.database.azure.com"
+       registration_enabled  = false
+       resource_group_name   = "rg-three-tier-app-prod-centralus"
+       virtual_network_id    = (known after apply)
    }

  # module.database.azurerm_private_endpoint.default will be created
+   resource "azurerm_private_endpoint" "default" {
+       custom_dns_configs       = (known after apply)
+       id                       = (known after apply)
+       location                 = "centralus"
+       name                     = "pe-db-three-tier-app-prod-centralus"
+       network_interface        = (known after apply)
+       private_dns_zone_configs = (known after apply)
+       resource_group_name      = "rg-three-tier-app-prod-centralus"
+       subnet_id                = (known after apply)

+       private_dns_zone_group {
+           id                   = (known after apply)
+           name                 = "dns-zone-group1"
+           private_dns_zone_ids = (known after apply)
        }

+       private_service_connection {
+           is_manual_connection           = false
+           name                           = "private-serviceconnection1"
+           private_connection_resource_id = (known after apply)
+           private_ip_address             = (known after apply)
+           subresource_names              = [
+               "mysqlServer",
            ]
        }
    }

  # module.database.azurerm_subnet.this will be created
+   resource "azurerm_subnet" "this" {
+       address_prefixes                              = [
+           "10.254.0.0/26",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = (known after apply)
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-three-tier-app-prod-centralus"
+       virtual_network_name                          = "vnet-three-tier-app-prod-centralus"
    }

  # module.frontdoor.azurerm_cdn_frontdoor_endpoint.this will be created
+   resource "azurerm_cdn_frontdoor_endpoint" "this" {
+       cdn_frontdoor_profile_id = (known after apply)
+       enabled                  = true
+       host_name                = (known after apply)
+       id                       = (known after apply)
+       name                     = "fd-endpoint"
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin.this["frontend-0"] will be created
+   resource "azurerm_cdn_frontdoor_origin" "this" {
+       cdn_frontdoor_origin_group_id  = (known after apply)
+       certificate_name_check_enabled = true
+       enabled                        = true
+       host_name                      = (known after apply)
+       http_port                      = 80
+       https_port                     = 443
+       id                             = (known after apply)
+       name                           = "fd-origin-frontend-0"
+       origin_host_header             = (known after apply)
+       priority                       = 1
+       weight                         = 100
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin.this["frontend-1"] will be created
+   resource "azurerm_cdn_frontdoor_origin" "this" {
+       cdn_frontdoor_origin_group_id  = (known after apply)
+       certificate_name_check_enabled = true
+       enabled                        = true
+       host_name                      = (known after apply)
+       http_port                      = 80
+       https_port                     = 443
+       id                             = (known after apply)
+       name                           = "fd-origin-frontend-1"
+       origin_host_header             = (known after apply)
+       priority                       = 1
+       weight                         = 100
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin_group.this["frontend"] will be created
+   resource "azurerm_cdn_frontdoor_origin_group" "this" {
+       cdn_frontdoor_profile_id                                  = (known after apply)
+       id                                                        = (known after apply)
+       name                                                      = "fd-origin-group-frontend"
+       restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
+       session_affinity_enabled                                  = false

+       health_probe {
+           interval_in_seconds = 30
+           path                = "/"
+           protocol            = "Https"
+           request_type        = "HEAD"
        }

+       load_balancing {
+           additional_latency_in_milliseconds = 0
+           sample_size                        = 16
+           successful_samples_required        = 3
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_profile.this will be created
+   resource "azurerm_cdn_frontdoor_profile" "this" {
+       id                       = (known after apply)
+       name                     = "fd-profile"
+       resource_group_name      = "rg-three-tier-app-prod-centralus"
+       resource_guid            = (known after apply)
+       response_timeout_seconds = 120
+       sku_name                 = "Standard_AzureFrontDoor"
    }

  # module.frontdoor.azurerm_cdn_frontdoor_route.frontend["frontend"] will be created
+   resource "azurerm_cdn_frontdoor_route" "frontend" {
+       cdn_frontdoor_endpoint_id     = (known after apply)
+       cdn_frontdoor_origin_group_id = (known after apply)
+       cdn_frontdoor_origin_ids      = (known after apply)
+       enabled                       = true
+       forwarding_protocol           = "HttpsOnly"
+       https_redirect_enabled        = true
+       id                            = (known after apply)
+       link_to_default_domain        = true
+       name                          = "fd-route-frontend"
+       patterns_to_match             = [
+           "/*",
        ]
+       supported_protocols           = [
+           "Http",
+           "Https",
        ]
    }

  # module.naming["centralus"].random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.naming["centralus"].random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.naming["eastus"].random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.naming["eastus"].random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.asp["centralus"].module.asp.azurerm_service_plan.this will be created
+   resource "azurerm_service_plan" "this" {
+       id                              = (known after apply)
+       kind                            = (known after apply)
+       location                        = "centralus"
+       maximum_elastic_worker_count    = (known after apply)
+       name                            = "plan-three-tier-app-prod-centralus"
+       os_type                         = "Linux"
+       per_site_scaling_enabled        = false
+       premium_plan_auto_scale_enabled = false
+       reserved                        = (known after apply)
+       resource_group_name             = "rg-three-tier-app-prod-centralus"
+       sku_name                        = "S1"
+       worker_count                    = 3
+       zone_balancing_enabled          = true
    }

  # module.asp["centralus"].module.asp.modtm_telemetry.telemetry[0] will be created
+   resource "modtm_telemetry" "telemetry" {
+       ephemeral_number = (known after apply)
+       id               = (known after apply)
+       nonce            = (known after apply)
+       tags             = {
+           "location"        = "centralus"
+           "module_source"   = "git::https://github.com/Azure/terraform-azurerm-avm-res-web-serverfarm.git?ref=8ca49e2"
+           "module_version"  = null
+           "random_id"       = (known after apply)
+           "subscription_id" = "************************************"
+           "tenant_id"       = "************************************"
        }
    }

  # module.asp["centralus"].module.asp.random_uuid.telemetry[0] will be created
+   resource "random_uuid" "telemetry" {
+       id     = (known after apply)
+       result = (known after apply)
    }

  # module.asp["centralus"].module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.asp["centralus"].module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.asp["eastus"].module.asp.azurerm_service_plan.this will be created
+   resource "azurerm_service_plan" "this" {
+       id                              = (known after apply)
+       kind                            = (known after apply)
+       location                        = "eastus"
+       maximum_elastic_worker_count    = (known after apply)
+       name                            = "plan-three-tier-app-prod-eastus"
+       os_type                         = "Linux"
+       per_site_scaling_enabled        = false
+       premium_plan_auto_scale_enabled = false
+       reserved                        = (known after apply)
+       resource_group_name             = "rg-three-tier-app-prod-eastus"
+       sku_name                        = "S1"
+       worker_count                    = 3
+       zone_balancing_enabled          = true
    }

  # module.asp["eastus"].module.asp.modtm_telemetry.telemetry[0] will be created
+   resource "modtm_telemetry" "telemetry" {
+       ephemeral_number = (known after apply)
+       id               = (known after apply)
+       nonce            = (known after apply)
+       tags             = {
+           "location"        = "eastus"
+           "module_source"   = "git::https://github.com/Azure/terraform-azurerm-avm-res-web-serverfarm.git?ref=8ca49e2"
+           "module_version"  = null
+           "random_id"       = (known after apply)
+           "subscription_id" = "************************************"
+           "tenant_id"       = "************************************"
        }
    }

  # module.asp["eastus"].module.asp.random_uuid.telemetry[0] will be created
+   resource "random_uuid" "telemetry" {
+       id     = (known after apply)
+       result = (known after apply)
    }

  # module.asp["eastus"].module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.asp["eastus"].module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.backend["centralus"].module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.backend["centralus"].module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.backend["centralus"].module.webapp.data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
+       client_id       = (known after apply)
+       id              = (known after apply)
+       object_id       = (known after apply)
+       subscription_id = (known after apply)
+       tenant_id       = (known after apply)
    }

  # module.backend["centralus"].module.webapp.data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
+       module_path    = "/tmp/terraform-data-dir/modules/backend.webapp"
+       module_source  = (known after apply)
+       module_version = (known after apply)
    }

  # module.backend["centralus"].module.webapp.azurerm_application_insights.this[0] will be created
+   resource "azurerm_application_insights" "this" {
+       app_id                              = (known after apply)
+       application_type                    = "web"
+       connection_string                   = (sensitive value)
+       daily_data_cap_in_gb                = 100
+       disable_ip_masking                  = false
+       force_customer_storage_for_profiler = false
+       id                                  = (known after apply)
+       instrumentation_key                 = (sensitive value)
+       internet_ingestion_enabled          = true
+       internet_query_enabled              = true
+       local_authentication_disabled       = false
+       location                            = "centralus"
+       name                                = "ai-app-be-three-tier-app-prod-centralus"
+       resource_group_name                 = "rg-three-tier-app-prod-centralus"
+       retention_in_days                   = 90
+       sampling_percentage                 = 100
+       workspace_id                        = (known after apply)
    }

  # module.backend["centralus"].module.webapp.azurerm_linux_web_app.this[0] will be created
+   resource "azurerm_linux_web_app" "this" {
+       app_settings                                   = (known after apply)
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = false
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = true
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "centralus"
+       name                                           = "app-be-three-tier-app-prod-centralus"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "rg-three-tier-app-prod-centralus"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       virtual_network_backup_restore_enabled         = false
+       virtual_network_subnet_id                      = (known after apply)
+       webdeploy_publish_basic_authentication_enabled = false
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "Disabled"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.3"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = false
+           vnet_route_all_enabled                  = true
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-appservice-backend:sha-cbe36cbc041c06ddeb23e85ea478f18f63571052"
+               docker_registry_url = "https://ghcr.io/hasanashab"
            }
        }
    }

  # module.backend["centralus"].module.webapp.modtm_telemetry.telemetry[0] will be created
+   resource "modtm_telemetry" "telemetry" {
+       ephemeral_number = (known after apply)
+       id               = (known after apply)
+       nonce            = (known after apply)
+       tags             = {
+           "location"        = "centralus"
+           "module_source"   = (known after apply)
+           "module_version"  = (known after apply)
+           "random_id"       = (known after apply)
+           "subscription_id" = (known after apply)
+           "tenant_id"       = (known after apply)
        }
    }

  # module.backend["centralus"].module.webapp.random_uuid.telemetry[0] will be created
+   resource "random_uuid" "telemetry" {
+       id     = (known after apply)
+       result = (known after apply)
    }

  # module.backend["eastus"].module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.backend["eastus"].module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.backend["eastus"].module.webapp.data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
+       client_id       = (known after apply)
+       id              = (known after apply)
+       object_id       = (known after apply)
+       subscription_id = (known after apply)
+       tenant_id       = (known after apply)
    }

  # module.backend["eastus"].module.webapp.data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
+       module_path    = "/tmp/terraform-data-dir/modules/backend.webapp"
+       module_source  = (known after apply)
+       module_version = (known after apply)
    }

  # module.backend["eastus"].module.webapp.azurerm_application_insights.this[0] will be created
+   resource "azurerm_application_insights" "this" {
+       app_id                              = (known after apply)
+       application_type                    = "web"
+       connection_string                   = (sensitive value)
+       daily_data_cap_in_gb                = 100
+       disable_ip_masking                  = false
+       force_customer_storage_for_profiler = false
+       id                                  = (known after apply)
+       instrumentation_key                 = (sensitive value)
+       internet_ingestion_enabled          = true
+       internet_query_enabled              = true
+       local_authentication_disabled       = false
+       location                            = "eastus"
+       name                                = "ai-app-be-three-tier-app-prod-eastus"
+       resource_group_name                 = "rg-three-tier-app-prod-eastus"
+       retention_in_days                   = 90
+       sampling_percentage                 = 100
+       workspace_id                        = (known after apply)
    }

  # module.backend["eastus"].module.webapp.azurerm_linux_web_app.this[0] will be created
+   resource "azurerm_linux_web_app" "this" {
+       app_settings                                   = (known after apply)
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = false
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = true
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "eastus"
+       name                                           = "app-be-three-tier-app-prod-eastus"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "rg-three-tier-app-prod-eastus"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       virtual_network_backup_restore_enabled         = false
+       virtual_network_subnet_id                      = (known after apply)
+       webdeploy_publish_basic_authentication_enabled = false
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "Disabled"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.3"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = false
+           vnet_route_all_enabled                  = true
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-appservice-backend:sha-cbe36cbc041c06ddeb23e85ea478f18f63571052"
+               docker_registry_url = "https://ghcr.io/hasanashab"
            }
        }
    }

  # module.backend["eastus"].module.webapp.modtm_telemetry.telemetry[0] will be created
+   resource "modtm_telemetry" "telemetry" {
+       ephemeral_number = (known after apply)
+       id               = (known after apply)
+       nonce            = (known after apply)
+       tags             = {
+           "location"        = "eastus"
+           "module_source"   = (known after apply)
+           "module_version"  = (known after apply)
+           "random_id"       = (known after apply)
+           "subscription_id" = (known after apply)
+           "tenant_id"       = (known after apply)
        }
    }

  # module.backend["eastus"].module.webapp.random_uuid.telemetry[0] will be created
+   resource "random_uuid" "telemetry" {
+       id     = (known after apply)
+       result = (known after apply)
    }

  # module.database.module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.database.module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.frontend["centralus"].module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.frontend["centralus"].module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.frontend["centralus"].module.webapp.azurerm_application_insights.this[0] will be created
+   resource "azurerm_application_insights" "this" {
+       app_id                              = (known after apply)
+       application_type                    = "web"
+       connection_string                   = (sensitive value)
+       daily_data_cap_in_gb                = 100
+       disable_ip_masking                  = false
+       force_customer_storage_for_profiler = false
+       id                                  = (known after apply)
+       instrumentation_key                 = (sensitive value)
+       internet_ingestion_enabled          = true
+       internet_query_enabled              = true
+       local_authentication_disabled       = false
+       location                            = "centralus"
+       name                                = "ai-app-fe-three-tier-app-prod-centralus"
+       resource_group_name                 = "rg-three-tier-app-prod-centralus"
+       retention_in_days                   = 90
+       sampling_percentage                 = 100
+       workspace_id                        = (known after apply)
    }

  # module.frontend["centralus"].module.webapp.azurerm_linux_web_app.this[0] will be created
+   resource "azurerm_linux_web_app" "this" {
+       app_settings                                   = (known after apply)
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = false
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = true
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "centralus"
+       name                                           = "app-fe-three-tier-app-prod-centralus"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "rg-three-tier-app-prod-centralus"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       virtual_network_backup_restore_enabled         = false
+       webdeploy_publish_basic_authentication_enabled = false
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "Disabled"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.3"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = false
+           vnet_route_all_enabled                  = true
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-appservice-frontend:sha-de75f229d6ab0f0ca44484de9eae334b77a53099"
+               docker_registry_url = "https://ghcr.io/hasanashab"
            }
        }
    }

  # module.frontend["centralus"].module.webapp.modtm_telemetry.telemetry[0] will be created
+   resource "modtm_telemetry" "telemetry" {
+       ephemeral_number = (known after apply)
+       id               = (known after apply)
+       nonce            = (known after apply)
+       tags             = {
+           "location"        = "centralus"
+           "module_source"   = "git::https://github.com/Azure/terraform-azurerm-avm-res-web-site.git?ref=5388703"
+           "module_version"  = null
+           "random_id"       = (known after apply)
+           "subscription_id" = "************************************"
+           "tenant_id"       = "************************************"
        }
    }

  # module.frontend["centralus"].module.webapp.random_uuid.telemetry[0] will be created
+   resource "random_uuid" "telemetry" {
+       id     = (known after apply)
+       result = (known after apply)
    }

  # module.frontend["eastus"].module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.frontend["eastus"].module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.frontend["eastus"].module.webapp.azurerm_application_insights.this[0] will be created
+   resource "azurerm_application_insights" "this" {
+       app_id                              = (known after apply)
+       application_type                    = "web"
+       connection_string                   = (sensitive value)
+       daily_data_cap_in_gb                = 100
+       disable_ip_masking                  = false
+       force_customer_storage_for_profiler = false
+       id                                  = (known after apply)
+       instrumentation_key                 = (sensitive value)
+       internet_ingestion_enabled          = true
+       internet_query_enabled              = true
+       local_authentication_disabled       = false
+       location                            = "eastus"
+       name                                = "ai-app-fe-three-tier-app-prod-eastus"
+       resource_group_name                 = "rg-three-tier-app-prod-eastus"
+       retention_in_days                   = 90
+       sampling_percentage                 = 100
+       workspace_id                        = (known after apply)
    }

  # module.frontend["eastus"].module.webapp.azurerm_linux_web_app.this[0] will be created
+   resource "azurerm_linux_web_app" "this" {
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [CI-CD pipeline #110](https://github.com/HasanAshab/spring-react-devops-appservice-infra/actions/runs/16520686950)